src/app/controllers/api/v1/todos_controller.rb

    def index
        todos = Todo.order(updated_at: :desc)
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`deleted_at` = FALSE ORDER BY `todos`.`updated_at` DESC

    def show
        todo = Todo.find(params[:id])
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 1 LIMIT 1

    def create
        todo = Todo.new(todo_params)
        if todo.save
---
INSERT INTO `todos` (`name`, `created_at`, `updated_at`) VALUES ('テスト', '2021-05-02 04:18:21.867388', '2021-05-02 04:18:21.867388')

    def update
        todo = Todo.find(params[:id])
        if todo.update(todo_params)
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 3 LIMIT 1
UPDATE `todos` SET `todos`.`is_completed` = FALSE, `todos`.`updated_at` = '2021-05-01 19:30:39.779141' WHERE `todos`.`id` = 1

    def destroy
        if Todo.destroy(params[:id])
---
DELETE FROM `todos` WHERE `todos`.`id` = 10

    def destroy_all
        if Todo.destroy_all
---
DELETE FROM `todos` WHERE `todos`.`id` = 1