src/app/controllers/api/v1/todos_controller.rb

    def index
        todos = Todo.where(deleted_at: nil).order(created_at: :desc)
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`deleted_at` IS NULL ORDER BY `todos`.`created_at` DESC

    def destroy
        todo = Todo.find(params[:id])
---
SELECT `todos`.* FROM `todos` WHERE `todos`.`id` = 9 LIMIT 1

    def destroy_all
        todos = Todo.where(deleted_at: nil)
        if todos.update_all(deleted_at: DateTime.now)
---
UPDATE `todos` SET `todos`.`deleted_at` = '2021-05-05 12:20:32' WHERE `todos`.`deleted_at` IS NULL